{
  "Geo_Rock-Below_Gorb": "In the cave just below Gorb, there is a hidden alcove on the right.",
  "Geo_Rock-Dark_Deepnest_Above_Grub_2": "From the top transition, find the spike pit just below. There is a hidden tunnel in the pit.",
  "Geo_Rock-Deepnest_Below_Spike_Grub": "The spike pit at the top left of the room has a small hole. There are two checks next to each other.",
  "Geo_Rock-Deepnest_Below_Spike_Grub_Dupe": "The spike pit at the top left of the room has a small hole. There are two checks next to each other.",
  "Geo_Rock-Greenpath_Toll_Hidden": "There is a breakable wall above the bench/toll and to the left.",
  "Geo_Rock-Greenpath_Toll_Hidden_Dupe": "There is a breakable wall above the bench/toll and to the left.",
  "Geo_Rock-King's_Station": "From the lower right transition, climb up through a hidden shaft.",
  "Geo_Rock-Pale_Lurker": "From the left transition, drop down, hug the right wall, and dash/jump up to an alcove.",
  "Hallownest_Seal-Deepnest_By_Mantis_Lords": "At the top and center of the room, there is a hidden tunnel at the very top of the right wall.",
  "King's_Idol-Pale_Lurker": "From the bottom right of the room, swim through the acid.",
  "Lore_Tablet-Fungal_Core": "You need Spore Shroom equipped.",
  "Lore_Tablet-Fungal_Wastes_Below_Shrumal_Ogres": "You need Spore Shroom equipped.",
  "Lore_Tablet-Fungal_Wastes_Hidden": "From the left transition, climb the left wall. You need Spore Shroom equipped.",
  "Lore_Tablet-Greenpath_Upper_Hidden": "From the right transition, get to the top level and jump off to the right.",
  "Lore_Tablet-Kingdom's_Edge": "You need Spore Shroom equipped.",
  "Lore_Tablet-Palace_Throne": "From the King Fragment check/throne, there is a breakable wall all the way to the right.",
  "Lore_Tablet-Sanctum_Past_Soul_Master": "At the very top right corner of the room, there is a breakable Dive floor.",
  "Lore_Tablet-Spore_Shroom": "You need Spore Shroom equipped.",
  "Rancid_Egg-Beast's_Den": "There is an alcove in a wall on the right side of the room.",
  "Rancid_Egg-Upper_Kingdom's_Edge": "Find a large floating strcture around the top right. Inside it is a hidden alcove accessible from below.",
  "Soul_Totem-Beast's_Den": "The widest vertical shaft has an alcove on the left wall.",
  "Soul_Totem-Below_Xero": "There is a breakable wall above the lower left transition.",
  "Soul_Totem-Crossroads_Goam_Journal": "From the lower right transition, facing left, there is a breakable wall.",
  "Soul_Totem-Deepnest_Vessel": "Before pogo-ing the vertical Garpede, there is a breakable wall on the right.",
  "Soul_Totem-Hallownest_Crown": "Past the breakable Dive floor in the middle of the room.",
  "Soul_Totem-Kingdom's_Edge_Camp": "From the upper left transition, jump up two small platforms and jump left to a hidden alcove.",
  "Soul_Totem-Path_of_Pain_Entrance": "From the beginning of Path of Pain, Super Dash to the left.",
  "Vengeful_Spirit": "You may need to exhaust Snail Shaman's dialogue.",
  "Wanderer's_Journal-Greenpath_Lower": "From the bottom transition, follow the right wall up to a hidden alcove."
}